using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Rabanut.Service
{
    internal static class DateService
    {
        public static string GetDayInWeek(string day) => day switch
        {
            "ראשון" => "באחד בשבת",
            "שני" => "בשני בשבת",
            "שלישי" => "בשלישי בשבת",
            "רביעי" => "ברביעי בשבת",
            "חמישי" => "בחמישי בשבת",
            "ששי" => "בששי בשבת"
        };
        public static string GetDayAndMonth(string day, string month) => day switch
        {
            "1" => "יום אחד לירח " + month,
            "2" => "שני ימים לירח לירח " + month,
            "3" => "שלשה ימים לירח " + month,
            "4" => "ארבעה ימים לירח " + month,
            "5" => "חמשה ימים לירח " + month,
            "6" => "ששה ימים לירח " + month,
            "7" => "שבעה ימים לירח " + month,
            "8" => "שמנה ימים לירח " + month,
            "9" => "תשעה ימים לירח " + month,
            "10" => "עשרה ימים לירח " + month,
            "11" => "אחד עשר יום לירח " + month,
            "12" => "שנים עשר יום לירח " + month,
            "13" => "שלשה עשר יום לירח " + month,
            "14" => "ארבעה עשר יום לירח " + month,
            "15" => "חמשה עשר יום לירח " + month,
            "16" => "ששה עשר יום לירח " + month,
            "17" => "שבעה עשר יום לירח " + month,
            "18" => "שמנה עשר יום לירח " + month,
            "19" => "תשעה עשר יום לירח " + month,
            "20" => "עשרים יום לירח " + month,
            "21" => "אחד ועשרים יום לירח " + month,
            "22" => "שנים ועשרים יום לירח " + month,
            "23" => "שלשה ועשרים יום לירח " + month,
            "24" => "ארבעה ועשרים יום לירח " + month,
            "25" => "חמשה ועשרים יום לירח " + month,
            "26" => "ששה ועשרים יום לירח " + month,
            "27" => "שבעה ועשרים יום לירח " + month,
            "28" => "שמנה ועשרים יום לירח " + month,
            "29" => "תשעה ועשרים יום לירח " + month,
            "30" => "יום שלשים לחדש " + month + " שהוא ראש חודש " + GetNextMonth(month)
        };
        public static string GetNextMonth(string Month) => Month switch
        {
            "תשרי" => "מרחשון",
            "מרחשון" => "כסלו",
            "כסלו" => "טבת",
            "טבת" => "שבט",
            "שבט" => "אדר",
            "אדר" => "ניסן",
            "אדר הראשון" => "אדר השני",
            "אדר השני" => "ניסן",
            "ניסן" => "אייר",
            "אייר" => "סיון",
            "סיון" => "תמוז",
            "תמוז" => "אב",
            "אב" => "אלול",
            "אלול" => "תשרי"
        };
        public static string GetYear(string year) =>
            "שנת חמשת אלפים ושבע מאות ו" + year switch
            {
                @"תשפ""ד" => "שמנים וארבע",
                @"תשפ""ה" => "שמנים וחמש",
                @"תשפ""ו" => "שמנים ושש",
                @"תשפ""ז" => "שמנים ושבע",
                @"תשפ""ח" => "שמנים ושמנה",
                @"תשפ""ט" => "שמנים ותשע",
                @"תש""צ" => "תשעים",
                @"תשצ""א" => "תשעים ואחת",
                @"תשצ""ב" => "תשעים ושתים",
                @"תשצ""ג" => "תשעים ושלש"
            } + " לבריאת העולם";
    }
}
